diagrams/include_dependencies.mmd
flowchart
    subgraph C_0005987407375906095790[FrameWork_2DAPI]
    subgraph C_0009079422266128183806[Compoment]
    C_0000542131175853268262[Camera.cpp]
    C_0002233206018820285275[Camera.h]
    C_0012006922542282881227[Component.h]
    C_0005719404820632631720[Transform.h]
    C_0002189911845737725449[Collider.cpp]
    C_0006009038626991597040[Collider.h]
    C_0013968366448891272726[Component.cpp]
    C_0008580941411690267369[ImageComponent.cpp]
    C_0013959013035525480656[ImageComponent.h]
    C_0010868901553585101876[LineComponent.cpp]
    C_0007515418281770493621[LineComponent.h]
    C_0000320882183835896086[RectLineComponent.cpp]
    C_0006393931006940933067[RectLineComponent.h]
    C_0005358857604292455793[Transform.cpp]
    end
    subgraph C_0011265527563778237801[Core]
    C_0011403750343696262879[Rect.h]
    C_0009241864309396972362[Vector.h]
    C_0004042546161801080444[GameObject.h]
    C_0005103878031763531942[SingletonT.h]
    C_0007280088687045988429[DebugLineComponent.h]
    C_0015706010924517967619[DebugObject.h]
    C_0012295491533869988163[DebugRectLineComponent.h]
    C_0002232915519477697411[DebugText.h]
    C_0006299312231707710825[MyMath.h]
    C_0001671004573157420316[DebugLineComponent.cpp]
    C_0006265843618639935582[DebugObject.cpp]
    C_0002435491690557600414[DebugRectLineComponent.cpp]
    C_0001441129750274846942[DebugText.cpp]
    C_0004593396786342407477[GameObject.cpp]
    C_0006715012369522388591[InputManager.cpp]
    C_0008490262948685167826[InputManager.h]
    C_0013530310977228940505[Material.cpp]
    C_0015703106579219591232[Material.h]
    C_0013447363267887917608[MyMath.cpp]
    C_0006108638845670503619[MyString.cpp]
    C_0003891611166247611878[MyString.h]
    C_0013268641514221186231[MyTime.cpp]
    C_0012761271053487719786[MyTime.h]
    C_0015418236043798760602[MyUtil.cpp]
    C_0005440123908566855679[MyUtil.h]
    C_0015204365231920836278[Viewport.cpp]
    C_0002856403762398272363[Viewport.h]
    C_0015350113566451572951[DefineHeader.h]
    C_0001728310481282724229[TimerManager.h]
    end
    subgraph C_0007357198411899871477[Manager]
    C_0000975214415346362189[CameraManager.h]
    C_0005264507623711508609[ImageManager.h]
    C_0009054403874184420606[DebugObjectManager.h]
    C_0011795145165219994652[CameraManager.cpp]
    C_0005844838692460862043[GameObjectManager.h]
    C_0003657921832410450859[DebugObjectManager.cpp]
    C_0004144003590797335675[FacadeManager.cpp]
    C_0016844551399312654414[FacadeManager.h]
    C_0007166487911516875814[GameObjectManager.cpp]
    C_0016749223998467583664[ImageManager.cpp]
    end
    subgraph C_0006349955410683132918[Scene]
    C_0013424696354905452145[Scene.cpp]
    C_0014113046361969808040[Scene.h]
    end
    subgraph C_0014903899459858743212[UICompoment]
    C_0015108746298517492543[Button.cpp]
    C_0014675849799759254562[Button.h]
    C_0005596289685074760462[RichTextAndInputFieldComponent.cpp]
    C_0016995368971307459379[RichTextAndInputFieldComponent.h]
    C_0001805303676707499043[RichTextComponent.cpp]
    C_0017931631642561992518[RichTextComponent.h]
    C_0010503176285208422829[TextComponent.cpp]
    C_0011619476113675404708[TextComponent.h]
    end
    C_0007522631347308452242[BaseGame.cpp]
    C_0001748520534377182215[BaseGame.h]
    C_0017691936045283160068[FrameWork_2DAPI.cpp]
    C_0017495671912026114932[framework.h]
    C_0012947420176480543526[targetver.h]
    C_0009079868531278845189[FrameWork_2DAPI.h]
    C_0006231518002176939064[Resource.h]
    end
    C_0000542131175853268262 --> C_0002233206018820285275
    C_0000542131175853268262 --> C_0004042546161801080444
    C_0000542131175853268262 --> C_0005719404820632631720
    C_0000542131175853268262 --> C_0000975214415346362189
    C_0002233206018820285275 --> C_0011403750343696262879
    C_0002233206018820285275 --> C_0012006922542282881227
    C_0005719404820632631720 --> C_0012006922542282881227
    C_0005719404820632631720 --> C_0009241864309396972362
    C_0002189911845737725449 --> C_0006009038626991597040
    C_0002189911845737725449 --> C_0004042546161801080444
    C_0002189911845737725449 --> C_0012006922542282881227
    C_0002189911845737725449 --> C_0005719404820632631720
    C_0006009038626991597040 --> C_0011403750343696262879
    C_0006009038626991597040 --> C_0012006922542282881227
    C_0006009038626991597040 --> C_0005719404820632631720
    C_0006009038626991597040 --> C_0009241864309396972362
    C_0013968366448891272726 --> C_0012006922542282881227
    C_0013968366448891272726 --> C_0004042546161801080444
    C_0013968366448891272726 --> C_0005719404820632631720
    C_0008580941411690267369 --> C_0013959013035525480656
    C_0008580941411690267369 --> C_0004042546161801080444
    C_0008580941411690267369 --> C_0005719404820632631720
    C_0008580941411690267369 --> C_0005264507623711508609
    C_0008580941411690267369 --> C_0000975214415346362189
    C_0008580941411690267369 --> C_0002233206018820285275
    C_0008580941411690267369 --> C_0009054403874184420606
    C_0008580941411690267369 --> C_0006299312231707710825
    C_0008580941411690267369 --> C_0015706010924517967619
    C_0008580941411690267369 --> C_0007280088687045988429
    C_0008580941411690267369 --> C_0012295491533869988163
    C_0013959013035525480656 --> C_0012006922542282881227
    C_0010868901553585101876 --> C_0007515418281770493621
    C_0010868901553585101876 --> C_0011403750343696262879
    C_0010868901553585101876 --> C_0012006922542282881227
    C_0010868901553585101876 --> C_0005719404820632631720
    C_0010868901553585101876 --> C_0009241864309396972362
    C_0010868901553585101876 --> C_0002233206018820285275
    C_0010868901553585101876 --> C_0000975214415346362189
    C_0007515418281770493621 --> C_0011403750343696262879
    C_0007515418281770493621 --> C_0012006922542282881227
    C_0007515418281770493621 --> C_0005719404820632631720
    C_0007515418281770493621 --> C_0009241864309396972362
    C_0000320882183835896086 --> C_0006393931006940933067
    C_0000320882183835896086 --> C_0002233206018820285275
    C_0000320882183835896086 --> C_0000975214415346362189
    C_0006393931006940933067 --> C_0011403750343696262879
    C_0006393931006940933067 --> C_0012006922542282881227
    C_0006393931006940933067 --> C_0005719404820632631720
    C_0006393931006940933067 --> C_0009241864309396972362
    C_0005358857604292455793 --> C_0005719404820632631720
    C_0005358857604292455793 --> C_0002233206018820285275
    C_0011403750343696262879 --> C_0009241864309396972362
    C_0004042546161801080444 --> C_0012006922542282881227
    C_0007280088687045988429 --> C_0011403750343696262879
    C_0007280088687045988429 --> C_0015706010924517967619
    C_0007280088687045988429 --> C_0009241864309396972362
    C_0007280088687045988429 --> C_0005719404820632631720
    C_0015706010924517967619 --> C_0011403750343696262879
    C_0015706010924517967619 --> C_0004042546161801080444
    C_0015706010924517967619 --> C_0012006922542282881227
    C_0015706010924517967619 --> C_0005719404820632631720
    C_0015706010924517967619 --> C_0009241864309396972362
    C_0012295491533869988163 --> C_0011403750343696262879
    C_0012295491533869988163 --> C_0015706010924517967619
    C_0012295491533869988163 --> C_0009241864309396972362
    C_0012295491533869988163 --> C_0005719404820632631720
    C_0002232915519477697411 --> C_0011403750343696262879
    C_0002232915519477697411 --> C_0015706010924517967619
    C_0002232915519477697411 --> C_0009241864309396972362
    C_0002232915519477697411 --> C_0005719404820632631720
    C_0006299312231707710825 --> C_0009241864309396972362
    C_0001671004573157420316 --> C_0007280088687045988429
    C_0001671004573157420316 --> C_0002233206018820285275
    C_0001671004573157420316 --> C_0000975214415346362189
    C_0001671004573157420316 --> C_0006299312231707710825
    C_0006265843618639935582 --> C_0015706010924517967619
    C_0002435491690557600414 --> C_0012295491533869988163
    C_0002435491690557600414 --> C_0002233206018820285275
    C_0002435491690557600414 --> C_0000975214415346362189
    C_0002435491690557600414 --> C_0006299312231707710825
    C_0001441129750274846942 --> C_0002232915519477697411
    C_0001441129750274846942 --> C_0002233206018820285275
    C_0001441129750274846942 --> C_0000975214415346362189
    C_0001441129750274846942 --> C_0006299312231707710825
    C_0004593396786342407477 --> C_0004042546161801080444
    C_0004593396786342407477 --> C_0005719404820632631720
    C_0006715012369522388591 --> C_0008490262948685167826
    C_0013530310977228940505 --> C_0015703106579219591232
    C_0013447363267887917608 --> C_0006299312231707710825
    C_0006108638845670503619 --> C_0003891611166247611878
    C_0003891611166247611878 --> C_0009241864309396972362
    C_0013268641514221186231 --> C_0012761271053487719786
    C_0015418236043798760602 --> C_0005440123908566855679
    C_0005440123908566855679 --> C_0009241864309396972362
    C_0005440123908566855679 --> C_0005103878031763531942
    C_0015204365231920836278 --> C_0002856403762398272363
    C_0002856403762398272363 --> C_0009241864309396972362
    C_0002856403762398272363 --> C_0011403750343696262879
    C_0002856403762398272363 --> C_0012006922542282881227
    C_0000975214415346362189 --> C_0005103878031763531942
    C_0000975214415346362189 --> C_0009241864309396972362
    C_0005264507623711508609 --> C_0005103878031763531942
    C_0009054403874184420606 --> C_0005103878031763531942
    C_0009054403874184420606 --> C_0004042546161801080444
    C_0009054403874184420606 --> C_0009241864309396972362
    C_0009054403874184420606 --> C_0007280088687045988429
    C_0009054403874184420606 --> C_0012295491533869988163
    C_0009054403874184420606 --> C_0002232915519477697411
    C_0011795145165219994652 --> C_0000975214415346362189
    C_0011795145165219994652 --> C_0005844838692460862043
    C_0011795145165219994652 --> C_0002233206018820285275
    C_0005844838692460862043 --> C_0005103878031763531942
    C_0005844838692460862043 --> C_0004042546161801080444
    C_0003657921832410450859 --> C_0009054403874184420606
    C_0003657921832410450859 --> C_0004042546161801080444
    C_0003657921832410450859 --> C_0015706010924517967619
    C_0003657921832410450859 --> C_0007280088687045988429
    C_0003657921832410450859 --> C_0012295491533869988163
    C_0003657921832410450859 --> C_0002232915519477697411
    C_0004144003590797335675 --> C_0016844551399312654414
    C_0004144003590797335675 --> C_0000975214415346362189
    C_0004144003590797335675 --> C_0005844838692460862043
    C_0004144003590797335675 --> C_0005264507623711508609
    C_0016844551399312654414 --> C_0005103878031763531942
    C_0007166487911516875814 --> C_0005844838692460862043
    C_0007166487911516875814 --> C_0004042546161801080444
    C_0016749223998467583664 --> C_0005264507623711508609
    C_0013424696354905452145 --> C_0014113046361969808040
    C_0014113046361969808040 --> C_0004042546161801080444
    C_0015108746298517492543 --> C_0014675849799759254562
    C_0015108746298517492543 --> C_0004042546161801080444
    C_0015108746298517492543 --> C_0005719404820632631720
    C_0015108746298517492543 --> C_0002233206018820285275
    C_0015108746298517492543 --> C_0008490262948685167826
    C_0015108746298517492543 --> C_0000975214415346362189
    C_0014675849799759254562 --> C_0012006922542282881227
    C_0014675849799759254562 --> C_0005719404820632631720
    C_0005596289685074760462 --> C_0016995368971307459379
    C_0005596289685074760462 --> C_0004042546161801080444
    C_0005596289685074760462 --> C_0005719404820632631720
    C_0005596289685074760462 --> C_0015350113566451572951
    C_0016995368971307459379 --> C_0012006922542282881227
    C_0001805303676707499043 --> C_0017931631642561992518
    C_0001805303676707499043 --> C_0004042546161801080444
    C_0001805303676707499043 --> C_0005719404820632631720
    C_0001805303676707499043 --> C_0015350113566451572951
    C_0017931631642561992518 --> C_0012006922542282881227
    C_0010503176285208422829 --> C_0011619476113675404708
    C_0010503176285208422829 --> C_0004042546161801080444
    C_0010503176285208422829 --> C_0005719404820632631720
    C_0010503176285208422829 --> C_0015350113566451572951
    C_0010503176285208422829 --> C_0008490262948685167826
    C_0010503176285208422829 --> C_0002233206018820285275
    C_0010503176285208422829 --> C_0000975214415346362189
    C_0011619476113675404708 --> C_0012006922542282881227
    C_0007522631347308452242 --> C_0001748520534377182215
    C_0007522631347308452242 --> C_0001728310481282724229
    C_0007522631347308452242 --> C_0008490262948685167826
    C_0007522631347308452242 --> C_0012006922542282881227
    C_0007522631347308452242 --> C_0005719404820632631720
    C_0007522631347308452242 --> C_0013959013035525480656
    C_0007522631347308452242 --> C_0014675849799759254562
    C_0007522631347308452242 --> C_0011619476113675404708
    C_0007522631347308452242 --> C_0017931631642561992518
    C_0007522631347308452242 --> C_0016844551399312654414
    C_0007522631347308452242 --> C_0009054403874184420606
    C_0007522631347308452242 --> C_0000975214415346362189
    C_0007522631347308452242 --> C_0002233206018820285275
    C_0007522631347308452242 --> C_0007515418281770493621
    C_0007522631347308452242 --> C_0006393931006940933067
    C_0007522631347308452242 --> C_0005440123908566855679
    C_0001748520534377182215 --> C_0014113046361969808040
    C_0017691936045283160068 --> C_0017495671912026114932
    C_0017691936045283160068 --> C_0009079868531278845189
    C_0017691936045283160068 --> C_0001748520534377182215
    C_0017495671912026114932 --> C_0012947420176480543526
    C_0009079868531278845189 --> C_0006231518002176939064

%% Generated with clang-uml, version 0.6.2
%% LLVM version clang version 20.1.7 (https://github.com/llvm/llvm-project.git 6146a88f60492b520a36f8f8f3231e15f3cc6082)
