diagrams/include_dependencies.puml
@startuml
!theme plain
left to right direction
folder "FrameWork_2DAPI" as C_0005987407375906095790 {
folder "Compoment" as C_0009079422266128183806 {
file "Camera.cpp" as C_0000542131175853268262
file "Camera.h" as C_0002233206018820285275
file "Component.h" as C_0012006922542282881227
file "Transform.h" as C_0005719404820632631720
file "Collider.cpp" as C_0002189911845737725449
file "Collider.h" as C_0006009038626991597040
file "Component.cpp" as C_0013968366448891272726
file "ImageComponent.cpp" as C_0008580941411690267369
file "ImageComponent.h" as C_0013959013035525480656
file "LineComponent.cpp" as C_0010868901553585101876
file "LineComponent.h" as C_0007515418281770493621
file "RectLineComponent.cpp" as C_0000320882183835896086
file "RectLineComponent.h" as C_0006393931006940933067
file "Transform.cpp" as C_0005358857604292455793
}
folder "Core" as C_0011265527563778237801 {
file "Rect.h" as C_0011403750343696262879
file "Vector.h" as C_0009241864309396972362
file "GameObject.h" as C_0004042546161801080444
file "SingletonT.h" as C_0005103878031763531942
file "DebugLineComponent.h" as C_0007280088687045988429
file "DebugObject.h" as C_0015706010924517967619
file "DebugRectLineComponent.h" as C_0012295491533869988163
file "DebugText.h" as C_0002232915519477697411
file "MyMath.h" as C_0006299312231707710825
file "DebugLineComponent.cpp" as C_0001671004573157420316
file "DebugObject.cpp" as C_0006265843618639935582
file "DebugRectLineComponent.cpp" as C_0002435491690557600414
file "DebugText.cpp" as C_0001441129750274846942
file "GameObject.cpp" as C_0004593396786342407477
file "InputManager.cpp" as C_0006715012369522388591
file "InputManager.h" as C_0008490262948685167826
file "Material.cpp" as C_0013530310977228940505
file "Material.h" as C_0015703106579219591232
file "MyMath.cpp" as C_0013447363267887917608
file "MyString.cpp" as C_0006108638845670503619
file "MyString.h" as C_0003891611166247611878
file "MyTime.cpp" as C_0013268641514221186231
file "MyTime.h" as C_0012761271053487719786
file "MyUtil.cpp" as C_0015418236043798760602
file "MyUtil.h" as C_0005440123908566855679
file "Viewport.cpp" as C_0015204365231920836278
file "Viewport.h" as C_0002856403762398272363
file "DefineHeader.h" as C_0015350113566451572951
file "TimerManager.h" as C_0001728310481282724229
}
folder "Manager" as C_0007357198411899871477 {
file "CameraManager.h" as C_0000975214415346362189
file "ImageManager.h" as C_0005264507623711508609
file "DebugObjectManager.h" as C_0009054403874184420606
file "CameraManager.cpp" as C_0011795145165219994652
file "GameObjectManager.h" as C_0005844838692460862043
file "DebugObjectManager.cpp" as C_0003657921832410450859
file "FacadeManager.cpp" as C_0004144003590797335675
file "FacadeManager.h" as C_0016844551399312654414
file "GameObjectManager.cpp" as C_0007166487911516875814
file "ImageManager.cpp" as C_0016749223998467583664
}
folder "Scene" as C_0006349955410683132918 {
file "Scene.cpp" as C_0013424696354905452145
file "Scene.h" as C_0014113046361969808040
}
folder "UICompoment" as C_0014903899459858743212 {
file "Button.cpp" as C_0015108746298517492543
file "Button.h" as C_0014675849799759254562
file "RichTextAndInputFieldComponent.cpp" as C_0005596289685074760462
file "RichTextAndInputFieldComponent.h" as C_0016995368971307459379
file "RichTextComponent.cpp" as C_0001805303676707499043
file "RichTextComponent.h" as C_0017931631642561992518
file "TextComponent.cpp" as C_0010503176285208422829
file "TextComponent.h" as C_0011619476113675404708
}
file "BaseGame.cpp" as C_0007522631347308452242
file "BaseGame.h" as C_0001748520534377182215
file "FrameWork_2DAPI.cpp" as C_0017691936045283160068
file "framework.h" as C_0017495671912026114932
file "targetver.h" as C_0012947420176480543526
file "FrameWork_2DAPI.h" as C_0009079868531278845189
file "Resource.h" as C_0006231518002176939064
}
C_0000542131175853268262 --> C_0002233206018820285275
C_0000542131175853268262 --> C_0004042546161801080444
C_0000542131175853268262 --> C_0005719404820632631720
C_0000542131175853268262 --> C_0000975214415346362189
C_0002233206018820285275 --> C_0011403750343696262879
C_0002233206018820285275 --> C_0012006922542282881227
C_0005719404820632631720 --> C_0012006922542282881227
C_0005719404820632631720 --> C_0009241864309396972362
C_0002189911845737725449 --> C_0006009038626991597040
C_0002189911845737725449 --> C_0004042546161801080444
C_0002189911845737725449 --> C_0012006922542282881227
C_0002189911845737725449 --> C_0005719404820632631720
C_0006009038626991597040 --> C_0011403750343696262879
C_0006009038626991597040 --> C_0012006922542282881227
C_0006009038626991597040 --> C_0005719404820632631720
C_0006009038626991597040 --> C_0009241864309396972362
C_0013968366448891272726 --> C_0012006922542282881227
C_0013968366448891272726 --> C_0004042546161801080444
C_0013968366448891272726 --> C_0005719404820632631720
C_0008580941411690267369 --> C_0013959013035525480656
C_0008580941411690267369 --> C_0004042546161801080444
C_0008580941411690267369 --> C_0005719404820632631720
C_0008580941411690267369 --> C_0005264507623711508609
C_0008580941411690267369 --> C_0000975214415346362189
C_0008580941411690267369 --> C_0002233206018820285275
C_0008580941411690267369 --> C_0009054403874184420606
C_0008580941411690267369 --> C_0006299312231707710825
C_0008580941411690267369 --> C_0015706010924517967619
C_0008580941411690267369 --> C_0007280088687045988429
C_0008580941411690267369 --> C_0012295491533869988163
C_0013959013035525480656 --> C_0012006922542282881227
C_0010868901553585101876 --> C_0007515418281770493621
C_0010868901553585101876 --> C_0011403750343696262879
C_0010868901553585101876 --> C_0012006922542282881227
C_0010868901553585101876 --> C_0005719404820632631720
C_0010868901553585101876 --> C_0009241864309396972362
C_0010868901553585101876 --> C_0002233206018820285275
C_0010868901553585101876 --> C_0000975214415346362189
C_0007515418281770493621 --> C_0011403750343696262879
C_0007515418281770493621 --> C_0012006922542282881227
C_0007515418281770493621 --> C_0005719404820632631720
C_0007515418281770493621 --> C_0009241864309396972362
C_0000320882183835896086 --> C_0006393931006940933067
C_0000320882183835896086 --> C_0002233206018820285275
C_0000320882183835896086 --> C_0000975214415346362189
C_0006393931006940933067 --> C_0011403750343696262879
C_0006393931006940933067 --> C_0012006922542282881227
C_0006393931006940933067 --> C_0005719404820632631720
C_0006393931006940933067 --> C_0009241864309396972362
C_0005358857604292455793 --> C_0005719404820632631720
C_0005358857604292455793 --> C_0002233206018820285275
C_0011403750343696262879 --> C_0009241864309396972362
C_0004042546161801080444 --> C_0012006922542282881227
C_0007280088687045988429 --> C_0011403750343696262879
C_0007280088687045988429 --> C_0015706010924517967619
C_0007280088687045988429 --> C_0009241864309396972362
C_0007280088687045988429 --> C_0005719404820632631720
C_0015706010924517967619 --> C_0011403750343696262879
C_0015706010924517967619 --> C_0004042546161801080444
C_0015706010924517967619 --> C_0012006922542282881227
C_0015706010924517967619 --> C_0005719404820632631720
C_0015706010924517967619 --> C_0009241864309396972362
C_0012295491533869988163 --> C_0011403750343696262879
C_0012295491533869988163 --> C_0015706010924517967619
C_0012295491533869988163 --> C_0009241864309396972362
C_0012295491533869988163 --> C_0005719404820632631720
C_0002232915519477697411 --> C_0011403750343696262879
C_0002232915519477697411 --> C_0015706010924517967619
C_0002232915519477697411 --> C_0009241864309396972362
C_0002232915519477697411 --> C_0005719404820632631720
C_0006299312231707710825 --> C_0009241864309396972362
C_0001671004573157420316 --> C_0007280088687045988429
C_0001671004573157420316 --> C_0002233206018820285275
C_0001671004573157420316 --> C_0000975214415346362189
C_0001671004573157420316 --> C_0006299312231707710825
C_0006265843618639935582 --> C_0015706010924517967619
C_0002435491690557600414 --> C_0012295491533869988163
C_0002435491690557600414 --> C_0002233206018820285275
C_0002435491690557600414 --> C_0000975214415346362189
C_0002435491690557600414 --> C_0006299312231707710825
C_0001441129750274846942 --> C_0002232915519477697411
C_0001441129750274846942 --> C_0002233206018820285275
C_0001441129750274846942 --> C_0000975214415346362189
C_0001441129750274846942 --> C_0006299312231707710825
C_0004593396786342407477 --> C_0004042546161801080444
C_0004593396786342407477 --> C_0005719404820632631720
C_0006715012369522388591 --> C_0008490262948685167826
C_0013530310977228940505 --> C_0015703106579219591232
C_0013447363267887917608 --> C_0006299312231707710825
C_0006108638845670503619 --> C_0003891611166247611878
C_0003891611166247611878 --> C_0009241864309396972362
C_0013268641514221186231 --> C_0012761271053487719786
C_0015418236043798760602 --> C_0005440123908566855679
C_0005440123908566855679 --> C_0009241864309396972362
C_0005440123908566855679 --> C_0005103878031763531942
C_0015204365231920836278 --> C_0002856403762398272363
C_0002856403762398272363 --> C_0009241864309396972362
C_0002856403762398272363 --> C_0011403750343696262879
C_0002856403762398272363 --> C_0012006922542282881227
C_0000975214415346362189 --> C_0005103878031763531942
C_0000975214415346362189 --> C_0009241864309396972362
C_0005264507623711508609 --> C_0005103878031763531942
C_0009054403874184420606 --> C_0005103878031763531942
C_0009054403874184420606 --> C_0004042546161801080444
C_0009054403874184420606 --> C_0009241864309396972362
C_0009054403874184420606 --> C_0007280088687045988429
C_0009054403874184420606 --> C_0012295491533869988163
C_0009054403874184420606 --> C_0002232915519477697411
C_0011795145165219994652 --> C_0000975214415346362189
C_0011795145165219994652 --> C_0005844838692460862043
C_0011795145165219994652 --> C_0002233206018820285275
C_0005844838692460862043 --> C_0005103878031763531942
C_0005844838692460862043 --> C_0004042546161801080444
C_0003657921832410450859 --> C_0009054403874184420606
C_0003657921832410450859 --> C_0004042546161801080444
C_0003657921832410450859 --> C_0015706010924517967619
C_0003657921832410450859 --> C_0007280088687045988429
C_0003657921832410450859 --> C_0012295491533869988163
C_0003657921832410450859 --> C_0002232915519477697411
C_0004144003590797335675 --> C_0016844551399312654414
C_0004144003590797335675 --> C_0000975214415346362189
C_0004144003590797335675 --> C_0005844838692460862043
C_0004144003590797335675 --> C_0005264507623711508609
C_0016844551399312654414 --> C_0005103878031763531942
C_0007166487911516875814 --> C_0005844838692460862043
C_0007166487911516875814 --> C_0004042546161801080444
C_0016749223998467583664 --> C_0005264507623711508609
C_0013424696354905452145 --> C_0014113046361969808040
C_0014113046361969808040 --> C_0004042546161801080444
C_0015108746298517492543 --> C_0014675849799759254562
C_0015108746298517492543 --> C_0004042546161801080444
C_0015108746298517492543 --> C_0005719404820632631720
C_0015108746298517492543 --> C_0002233206018820285275
C_0015108746298517492543 --> C_0008490262948685167826
C_0015108746298517492543 --> C_0000975214415346362189
C_0014675849799759254562 --> C_0012006922542282881227
C_0014675849799759254562 --> C_0005719404820632631720
C_0005596289685074760462 --> C_0016995368971307459379
C_0005596289685074760462 --> C_0004042546161801080444
C_0005596289685074760462 --> C_0005719404820632631720
C_0005596289685074760462 --> C_0015350113566451572951
C_0016995368971307459379 --> C_0012006922542282881227
C_0001805303676707499043 --> C_0017931631642561992518
C_0001805303676707499043 --> C_0004042546161801080444
C_0001805303676707499043 --> C_0005719404820632631720
C_0001805303676707499043 --> C_0015350113566451572951
C_0017931631642561992518 --> C_0012006922542282881227
C_0010503176285208422829 --> C_0011619476113675404708
C_0010503176285208422829 --> C_0004042546161801080444
C_0010503176285208422829 --> C_0005719404820632631720
C_0010503176285208422829 --> C_0015350113566451572951
C_0010503176285208422829 --> C_0008490262948685167826
C_0010503176285208422829 --> C_0002233206018820285275
C_0010503176285208422829 --> C_0000975214415346362189
C_0011619476113675404708 --> C_0012006922542282881227
C_0007522631347308452242 --> C_0001748520534377182215
C_0007522631347308452242 --> C_0001728310481282724229
C_0007522631347308452242 --> C_0008490262948685167826
C_0007522631347308452242 --> C_0012006922542282881227
C_0007522631347308452242 --> C_0005719404820632631720
C_0007522631347308452242 --> C_0013959013035525480656
C_0007522631347308452242 --> C_0014675849799759254562
C_0007522631347308452242 --> C_0011619476113675404708
C_0007522631347308452242 --> C_0017931631642561992518
C_0007522631347308452242 --> C_0016844551399312654414
C_0007522631347308452242 --> C_0009054403874184420606
C_0007522631347308452242 --> C_0000975214415346362189
C_0007522631347308452242 --> C_0002233206018820285275
C_0007522631347308452242 --> C_0007515418281770493621
C_0007522631347308452242 --> C_0006393931006940933067
C_0007522631347308452242 --> C_0005440123908566855679
C_0001748520534377182215 --> C_0014113046361969808040
C_0017691936045283160068 --> C_0017495671912026114932
C_0017691936045283160068 --> C_0009079868531278845189
C_0017691936045283160068 --> C_0001748520534377182215
C_0017495671912026114932 --> C_0012947420176480543526
C_0009079868531278845189 --> C_0006231518002176939064

'Generated with clang-uml, version 0.6.2
'LLVM version clang version 20.1.7 (https://github.com/llvm/llvm-project.git 6146a88f60492b520a36f8f8f3231e15f3cc6082)
@enduml
